## Plan Result (ptlsbox-jenkins)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_key_vault.jenkinskv-prod[0]
  * azurerm_key_vault_secret.env_subscription_id2[&#34;sbox&#34;]
  * random_password.jenkins-agent-password2
  * random_password.jenkins-agent-password3
* Update
  * azurerm_key_vault_secret.jenkins-agent-password
* Delete
  * azurerm_cosmosdb_sql_role_assignment.this
  * azurerm_key_vault_secret.db




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_role_assignment.this will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.this is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      - account_name        = "sds-jenkins-pipeline-metrics-sbox" -> null
      - id                  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics-sbox/sqlRoleAssignments/1105cafc-762e-f6bf-1763-ff3a40f826a5" -> null
      - name                = "1105cafc-762e-f6bf-1763-ff3a40f826a5" -> null
      - principal_id        = "6df94cb5-c203-4493-bc8a-3f6aad1133e1" -> null
      - resource_group_name = "sds-jenkins-ptlsbox-rg" -> null
      - role_definition_id  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics-sbox/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics-sbox" -> null
    }

  # azurerm_key_vault.jenkinskv-prod[0] will be created
  + resource "azurerm_key_vault" "jenkinskv-prod" {
      + access_policy              = (known after apply)
      + enable_rbac_authorization  = true
      + id                         = (known after apply)
      + location                   = "uksouth"
      + name                       = "prod-vault"
      + resource_group_name        = "sds-jenkins-ptlsbox-rg"
      + sku_name                   = "standard"
      + soft_delete_enabled        = (known after apply)
      + soft_delete_retention_days = 7
      + tags                       = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tenant_id                  = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                  = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_secret.db will be destroyed
  # (because azurerm_key_vault_secret.db is not in configuration)
  - resource "azurerm_key_vault_secret" "db" {
      - content_type   = "" -> null
      - id             = "https://ptlsbox.vault.azure.net/secrets/cosmosdb-token-key/8ee92194f0fb4a62a8b0e85981958a91" -> null
      - key_vault_id   = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/ptlsbox" -> null
      - name           = "cosmosdb-token-key" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "8ee92194f0fb4a62a8b0e85981958a91" -> null
      - versionless_id = "https://ptlsbox.vault.azure.net/secrets/cosmosdb-token-key" -> null
    }

  # azurerm_key_vault_secret.env_subscription_id2["sbox"] will be created
  + resource "azurerm_key_vault_secret" "env_subscription_id2" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/ptlsbox"
      + name           = "sbox-subscription-id2"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.jenkins-agent-password will be updated in-place
  ~ resource "azurerm_key_vault_secret" "jenkins-agent-password" {
        id             = "https://ptlsbox.vault.azure.net/secrets/jenkins-agent-password/dfac9a289dcc40fcbf15eb2246ae269b"
        name           = "jenkins-agent-password"
      ~ tags           = {
          + "foo"  = "foobar"
          + "hi"   = "hello"
          + "roo"  = "ruby"
          + "test" = "testing"
        }
        # (5 unchanged attributes hidden)
    }

  # random_password.jenkins-agent-password2 will be created
  + resource "random_password" "jenkins-agent-password2" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.jenkins-agent-password3 will be created
  + resource "random_password" "jenkins-agent-password3" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 14
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":41,"Program":"tfcmt","SHA1":"","Target":"ptlsbox-jenkins","Vars":{}} -->